newaetech/chipwhisperer/hardware/victims/firmware/hal/sam4l/asf/sam4l4/include/component/iisc.h
/* -------- IISC_MR : (IISC Offset: 0x04) (R/W 32) Mode Register -------- */
#define IISC_MR_OFFSET              0x04         /**< \brief (IISC_MR offset) Mode Register */
#define IISC_MR_RESETVALUE          0x00000000   /**< \brief (IISC_MR reset_value) Mode Register */

#define IISC_MR_MODE_Pos            0            /**< \brief (IISC_MR) Master/Slave/Controller Mode */
#define IISC_MR_MODE                (0x1u << IISC_MR_MODE_Pos)
#define   IISC_MR_MODE_SLAVE_Val          0x0u   /**< \brief (IISC_MR) Slave mode (only serial data handled, clocks received from external master or controller) */
#define   IISC_MR_MODE_MASTER_Val         0x1u   /**< \brief (IISC_MR) Master mode (clocks generated and output by IISC, serial data handled if CR.RXEN and/or CR.TXEN written to 1) */
#define IISC_MR_MODE_SLAVE          (IISC_MR_MODE_SLAVE_Val        << IISC_MR_MODE_Pos)
#define IISC_MR_MODE_MASTER         (IISC_MR_MODE_MASTER_Val       << IISC_MR_MODE_Pos)
#define IISC_MR_DATALENGTH_Pos      2            /**< \brief (IISC_MR) Data Word Length */
#define IISC_MR_DATALENGTH_Msk      (0x7u << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH(value)   ((IISC_MR_DATALENGTH_Msk & ((value) << IISC_MR_DATALENGTH_Pos)))
#define   IISC_MR_DATALENGTH_32_Val       0x0u   /**< \brief (IISC_MR) 32 bits */
#define   IISC_MR_DATALENGTH_24_Val       0x1u   /**< \brief (IISC_MR) 24 bits */
#define   IISC_MR_DATALENGTH_20_Val       0x2u   /**< \brief (IISC_MR) 20 bits */
#define   IISC_MR_DATALENGTH_18_Val       0x3u   /**< \brief (IISC_MR) 18 bits */
#define   IISC_MR_DATALENGTH_16_Val       0x4u   /**< \brief (IISC_MR) 16 bits */
#define   IISC_MR_DATALENGTH_16C_Val      0x5u   /**< \brief (IISC_MR) 16 bits compact stereo */
#define   IISC_MR_DATALENGTH_8_Val        0x6u   /**< \brief (IISC_MR) 8 bits */
#define   IISC_MR_DATALENGTH_8C_Val       0x7u   /**< \brief (IISC_MR) 8 bits compact stereo */
#define IISC_MR_DATALENGTH_32       (IISC_MR_DATALENGTH_32_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_24       (IISC_MR_DATALENGTH_24_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_20       (IISC_MR_DATALENGTH_20_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_18       (IISC_MR_DATALENGTH_18_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_16       (IISC_MR_DATALENGTH_16_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_16C      (IISC_MR_DATALENGTH_16C_Val    << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_8        (IISC_MR_DATALENGTH_8_Val      << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_8C       (IISC_MR_DATALENGTH_8C_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_RXMONO_Pos          8            /**< \brief (IISC_MR) Receiver Mono */
#define IISC_MR_RXMONO              (0x1u << IISC_MR_RXMONO_Pos)
#define   IISC_MR_RXMONO_STEREO_Val       0x0u   /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_RXMONO_MONO_Val         0x1u   /**< \brief (IISC_MR) Left channel data is duplicated to right channel */
#define IISC_MR_RXMONO_STEREO       (IISC_MR_RXMONO_STEREO_Val     << IISC_MR_RXMONO_Pos)
#define IISC_MR_RXMONO_MONO         (IISC_MR_RXMONO_MONO_Val       << IISC_MR_RXMONO_Pos)
#define IISC_MR_RXDMA_Pos           9            /**< \brief (IISC_MR) Single or Multiple DMA Channels for Receiver */
#define IISC_MR_RXDMA               (0x1u << IISC_MR_RXDMA_Pos)
#define   IISC_MR_RXDMA_SINGLE_Val        0x0u   /**< \brief (IISC_MR) Single DMA channel */
#define   IISC_MR_RXDMA_MULTIPLE_Val      0x1u   /**< \brief (IISC_MR) One DMA channel per data channel */
#define IISC_MR_RXDMA_SINGLE        (IISC_MR_RXDMA_SINGLE_Val      << IISC_MR_RXDMA_Pos)
#define IISC_MR_RXDMA_MULTIPLE      (IISC_MR_RXDMA_MULTIPLE_Val    << IISC_MR_RXDMA_Pos)
#define IISC_MR_RXLOOP_Pos          10           /**< \brief (IISC_MR) Loop-back Test Mode */
#define IISC_MR_RXLOOP              (0x1u << IISC_MR_RXLOOP_Pos)
#define   IISC_MR_RXLOOP_OFF_Val          0x0u   /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_RXLOOP_ON_Val           0x1u   /**< \brief (IISC_MR) ISDO internally connected to ISDI */
#define IISC_MR_RXLOOP_OFF          (IISC_MR_RXLOOP_OFF_Val        << IISC_MR_RXLOOP_Pos)
#define IISC_MR_RXLOOP_ON           (IISC_MR_RXLOOP_ON_Val         << IISC_MR_RXLOOP_Pos)
#define IISC_MR_TXMONO_Pos          12           /**< \brief (IISC_MR) Transmitter Mono */
#define IISC_MR_TXMONO              (0x1u << IISC_MR_TXMONO_Pos)
#define   IISC_MR_TXMONO_STEREO_Val       0x0u   /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_TXMONO_MONO_Val         0x1u   /**< \brief (IISC_MR) Left channel data is duplicated to right channel */
#define IISC_MR_TXMONO_STEREO       (IISC_MR_TXMONO_STEREO_Val     << IISC_MR_TXMONO_Pos)
#define IISC_MR_TXMONO_MONO         (IISC_MR_TXMONO_MONO_Val       << IISC_MR_TXMONO_Pos)
#define IISC_MR_TXDMA_Pos           13           /**< \brief (IISC_MR) Single or Multiple DMA Channels for Transmitter */
#define IISC_MR_TXDMA               (0x1u << IISC_MR_TXDMA_Pos)
#define   IISC_MR_TXDMA_SINGLE_Val        0x0u   /**< \brief (IISC_MR) Single DMA channel */
#define   IISC_MR_TXDMA_MULTIPLE_Val      0x1u   /**< \brief (IISC_MR) One DMA channel per data channel */
#define IISC_MR_TXDMA_SINGLE        (IISC_MR_TXDMA_SINGLE_Val      << IISC_MR_TXDMA_Pos)
#define IISC_MR_TXDMA_MULTIPLE      (IISC_MR_TXDMA_MULTIPLE_Val    << IISC_MR_TXDMA_Pos)
#define IISC_MR_TXSAME_Pos          14           /**< \brief (IISC_MR) Transmit Data when Underrun */
#define IISC_MR_TXSAME              (0x1u << IISC_MR_TXSAME_Pos)
#define   IISC_MR_TXSAME_ZERO_Val         0x0u   /**< \brief (IISC_MR) Zero data transmitted in case of underrun */
#define   IISC_MR_TXSAME_SAME_Val         0x1u   /**< \brief (IISC_MR) Last data transmitted in case of underrun */
#define IISC_MR_TXSAME_ZERO         (IISC_MR_TXSAME_ZERO_Val       << IISC_MR_TXSAME_Pos)
#define IISC_MR_TXSAME_SAME         (IISC_MR_TXSAME_SAME_Val       << IISC_MR_TXSAME_Pos)
#define IISC_MR_IMCKFS_Pos          24           /**< \brief (IISC_MR) Master Clock to fs Ratio */
#define IISC_MR_IMCKFS_Msk          (0x3Fu << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS(value)       ((IISC_MR_IMCKFS_Msk & ((value) << IISC_MR_IMCKFS_Pos)))
#define   IISC_MR_IMCKFS_16_Val           0x0u   /**< \brief (IISC_MR) 16 fs */
#define   IISC_MR_IMCKFS_32_Val           0x1u   /**< \brief (IISC_MR) 32 fs */
#define   IISC_MR_IMCKFS_64_Val           0x3u   /**< \brief (IISC_MR) 64 fs */
#define   IISC_MR_IMCKFS_128_Val          0x7u   /**< \brief (IISC_MR) 128 fs */
#define   IISC_MR_IMCKFS_256_Val          0xFu   /**< \brief (IISC_MR) 256 fs */
#define   IISC_MR_IMCKFS_384_Val          0x17u   /**< \brief (IISC_MR) 384 fs */
#define   IISC_MR_IMCKFS_512_Val          0x1Fu   /**< \brief (IISC_MR) 512 fs */
#define   IISC_MR_IMCKFS_768_Val          0x2Fu   /**< \brief (IISC_MR) 768 fs */
#define   IISC_MR_IMCKFS_1024_Val         0x3Fu   /**< \brief (IISC_MR) 1024 fs */
#define IISC_MR_IMCKFS_16           (IISC_MR_IMCKFS_16_Val         << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_32           (IISC_MR_IMCKFS_32_Val         << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_64           (IISC_MR_IMCKFS_64_Val         << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_128          (IISC_MR_IMCKFS_128_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_256          (IISC_MR_IMCKFS_256_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_384          (IISC_MR_IMCKFS_384_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_512          (IISC_MR_IMCKFS_512_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_768          (IISC_MR_IMCKFS_768_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_1024         (IISC_MR_IMCKFS_1024_Val       << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKMODE_Pos        30           /**< \brief (IISC_MR) Master Clock Mode */
#define IISC_MR_IMCKMODE            (0x1u << IISC_MR_IMCKMODE_Pos)
#define   IISC_MR_IMCKMODE_NO_IMCK_Val    0x0u   /**< \brief (IISC_MR) No IMCK generated */
#define   IISC_MR_IMCKMODE_IMCK_Val       0x1u   /**< \brief (IISC_MR) IMCK generated */
#define IISC_MR_IMCKMODE_NO_IMCK    (IISC_MR_IMCKMODE_NO_IMCK_Val  << IISC_MR_IMCKMODE_Pos)
#define IISC_MR_IMCKMODE_IMCK       (IISC_MR_IMCKMODE_IMCK_Val     << IISC_MR_IMCKMODE_Pos)
#define IISC_MR_IWS24_Pos           31           /**< \brief (IISC_MR) IWS Data Slot Width */
#define IISC_MR_IWS24               (0x1u << IISC_MR_IWS24_Pos)
#define   IISC_MR_IWS24_32_Val            0x0u   /**< \brief (IISC_MR) IWS Data Slot is 32-bit wide for DATALENGTH=18/20/24-bit */
#define   IISC_MR_IWS24_24_Val            0x1u   /**< \brief (IISC_MR) IWS Data Slot is 24-bit wide for DATALENGTH=18/20/24-bit */
#define IISC_MR_IWS24_32            (IISC_MR_IWS24_32_Val          << IISC_MR_IWS24_Pos)
#define IISC_MR_IWS24_24            (IISC_MR_IWS24_24_Val          << IISC_MR_IWS24_Pos)
#define IISC_MR_MASK                0xFF00771Du  /**< \brief (IISC_MR) MASK Register */

/* -------- IISC_SR : (IISC Offset: 0x08) (R/  32) Status Register -------- */
#define IISC_SR_OFFSET              0x08         /**< \brief (IISC_SR offset) Status Register */
#define IISC_SR_RESETVALUE          0x00000000   /**< \brief (IISC_SR reset_value) Status Register */

