newaetech/chipwhisperer/hardware/victims/firmware/hal/sam4l/asf/sam4l4/include/component/iisc.h
#define IISC_SSR_RXOR_Pos           2            /**< \brief (IISC_SSR) Receive Overrun */
#define IISC_SSR_RXOR               (0x1u << IISC_SSR_RXOR_Pos)
#define   IISC_SSR_RXOR_NO_Val            0x0u   /**< \brief (IISC_SSR) No effect */
#define   IISC_SSR_RXOR_SET_Val           0x1u   /**< \brief (IISC_SSR) Sets corresponding SR bit */
#define IISC_SSR_RXOR_NO            (IISC_SSR_RXOR_NO_Val          << IISC_SSR_RXOR_Pos)
#define IISC_SSR_RXOR_SET           (IISC_SSR_RXOR_SET_Val         << IISC_SSR_RXOR_Pos)
#define IISC_SSR_TXUR_Pos           6            /**< \brief (IISC_SSR) Transmit Underrun */
#define IISC_SSR_TXUR               (0x1u << IISC_SSR_TXUR_Pos)
#define   IISC_SSR_TXUR_NO_Val            0x0u   /**< \brief (IISC_SSR) No effect */
#define   IISC_SSR_TXUR_SET_Val           0x1u   /**< \brief (IISC_SSR) Sets corresponding SR bit */
#define IISC_SSR_TXUR_NO            (IISC_SSR_TXUR_NO_Val          << IISC_SSR_TXUR_Pos)
#define IISC_SSR_TXUR_SET           (IISC_SSR_TXUR_SET_Val         << IISC_SSR_TXUR_Pos)
#define IISC_SSR_RXORCH_Pos         8            /**< \brief (IISC_SSR) Receive Overrun Channels */
#define IISC_SSR_RXORCH_Msk         (0x3u << IISC_SSR_RXORCH_Pos)
#define IISC_SSR_RXORCH(value)      ((IISC_SSR_RXORCH_Msk & ((value) << IISC_SSR_RXORCH_Pos)))
#define IISC_SSR_TXURCH_Pos         20           /**< \brief (IISC_SSR) Transmit Underrun Channels */
#define IISC_SSR_TXURCH_Msk         (0x3u << IISC_SSR_TXURCH_Pos)
#define IISC_SSR_TXURCH(value)      ((IISC_SSR_TXURCH_Msk & ((value) << IISC_SSR_TXURCH_Pos)))
#define IISC_SSR_MASK               0x00300344u  /**< \brief (IISC_SSR) MASK Register */

/* -------- IISC_IER : (IISC Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define IISC_IER_OFFSET             0x14         /**< \brief (IISC_IER offset) Interrupt Enable Register */

#define IISC_IER_RXRDY_Pos          1            /**< \brief (IISC_IER) Receiver Ready Interrupt Enable */
#define IISC_IER_RXRDY              (0x1u << IISC_IER_RXRDY_Pos)
#define   IISC_IER_RXRDY_OFF_Val          0x0u   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_RXRDY_ON_Val           0x1u   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_RXRDY_OFF          (IISC_IER_RXRDY_OFF_Val        << IISC_IER_RXRDY_Pos)
#define IISC_IER_RXRDY_ON           (IISC_IER_RXRDY_ON_Val         << IISC_IER_RXRDY_Pos)
#define IISC_IER_RXOR_Pos           2            /**< \brief (IISC_IER) Receive Overrun Interrupt Enable */
#define IISC_IER_RXOR               (0x1u << IISC_IER_RXOR_Pos)
#define   IISC_IER_RXOR_OFF_Val           0x0u   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_RXOR_ON_Val            0x1u   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_RXOR_OFF           (IISC_IER_RXOR_OFF_Val         << IISC_IER_RXOR_Pos)
#define IISC_IER_RXOR_ON            (IISC_IER_RXOR_ON_Val          << IISC_IER_RXOR_Pos)
#define IISC_IER_TXRDY_Pos          5            /**< \brief (IISC_IER) Transmit Ready Interrupt Enable */
#define IISC_IER_TXRDY              (0x1u << IISC_IER_TXRDY_Pos)
#define   IISC_IER_TXRDY_OFF_Val          0x0u   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_TXRDY_ON_Val           0x1u   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_TXRDY_OFF          (IISC_IER_TXRDY_OFF_Val        << IISC_IER_TXRDY_Pos)
#define IISC_IER_TXRDY_ON           (IISC_IER_TXRDY_ON_Val         << IISC_IER_TXRDY_Pos)
#define IISC_IER_TXUR_Pos           6            /**< \brief (IISC_IER) Transmit Underrun Interrupt Enable */
#define IISC_IER_TXUR               (0x1u << IISC_IER_TXUR_Pos)
#define   IISC_IER_TXUR_OFF_Val           0x0u   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_TXUR_ON_Val            0x1u   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_TXUR_OFF           (IISC_IER_TXUR_OFF_Val         << IISC_IER_TXUR_Pos)
#define IISC_IER_TXUR_ON            (IISC_IER_TXUR_ON_Val          << IISC_IER_TXUR_Pos)
#define IISC_IER_MASK               0x00000066u  /**< \brief (IISC_IER) MASK Register */

/* -------- IISC_IDR : (IISC Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define IISC_IDR_OFFSET             0x18         /**< \brief (IISC_IDR offset) Interrupt Disable Register */

#define IISC_IDR_RXRDY_Pos          1            /**< \brief (IISC_IDR) Receive Ready Interrupt Disable */
#define IISC_IDR_RXRDY              (0x1u << IISC_IDR_RXRDY_Pos)
#define   IISC_IDR_RXRDY_OFF_Val          0x0u   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_RXRDY_ON_Val           0x1u   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_RXRDY_OFF          (IISC_IDR_RXRDY_OFF_Val        << IISC_IDR_RXRDY_Pos)
#define IISC_IDR_RXRDY_ON           (IISC_IDR_RXRDY_ON_Val         << IISC_IDR_RXRDY_Pos)
#define IISC_IDR_RXOR_Pos           2            /**< \brief (IISC_IDR) Receive Overrun Interrupt Disable */
#define IISC_IDR_RXOR               (0x1u << IISC_IDR_RXOR_Pos)
#define   IISC_IDR_RXOR_OFF_Val           0x0u   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_RXOR_ON_Val            0x1u   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_RXOR_OFF           (IISC_IDR_RXOR_OFF_Val         << IISC_IDR_RXOR_Pos)
#define IISC_IDR_RXOR_ON            (IISC_IDR_RXOR_ON_Val          << IISC_IDR_RXOR_Pos)
#define IISC_IDR_TXRDY_Pos          5            /**< \brief (IISC_IDR) Transmit Ready Interrupt Disable */
#define IISC_IDR_TXRDY              (0x1u << IISC_IDR_TXRDY_Pos)
#define   IISC_IDR_TXRDY_OFF_Val          0x0u   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_TXRDY_ON_Val           0x1u   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_TXRDY_OFF          (IISC_IDR_TXRDY_OFF_Val        << IISC_IDR_TXRDY_Pos)
#define IISC_IDR_TXRDY_ON           (IISC_IDR_TXRDY_ON_Val         << IISC_IDR_TXRDY_Pos)
#define IISC_IDR_TXUR_Pos           6            /**< \brief (IISC_IDR) Transmit Underrun Interrupt Disable */
#define IISC_IDR_TXUR               (0x1u << IISC_IDR_TXUR_Pos)
#define   IISC_IDR_TXUR_OFF_Val           0x0u   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_TXUR_ON_Val            0x1u   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_TXUR_OFF           (IISC_IDR_TXUR_OFF_Val         << IISC_IDR_TXUR_Pos)
#define IISC_IDR_TXUR_ON            (IISC_IDR_TXUR_ON_Val          << IISC_IDR_TXUR_Pos)
#define IISC_IDR_MASK               0x00000066u  /**< \brief (IISC_IDR) MASK Register */

/* -------- IISC_IMR : (IISC Offset: 0x1C) (R/  32) Interrupt Mask Register -------- */
#define IISC_IMR_OFFSET             0x1C         /**< \brief (IISC_IMR offset) Interrupt Mask Register */
#define IISC_IMR_RESETVALUE         0x00000000   /**< \brief (IISC_IMR reset_value) Interrupt Mask Register */

